[
    {
        "date": "2019-11-29",
        "timeStart": "14:30",
        "timeEnd": "15:00",
        "lang": "",
        "location": "Halls",
        "title": "Coffee-break",
        "talkTypeBadge": "",
        "talkLevelBadge": "",
        "description": "Coffee-break",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-29",
        "timeStart": "15:00",
        "timeEnd": "17:00",
        "lang": "En",
        "location": "Room #2, 2nd floor",
        "title": "Flutter speed coding",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Beginner",
        "description": "Building an app from a scratch within a few hours is no longer a dream. Get rid of html/css/js nightmare. Get native performance. Build cross platform.",
        "speakers": [
            "VsevolodHrechaniuk"
        ]
    },
    {
        "date": "2019-11-29",
        "timeStart": "15:00",
        "timeEnd": "16:00",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "Mission Possible: Build PWA out of Web Components in 180 minutes",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "We'll build a fully functional cross-platform Progressive Web App (PWA), using modern hardware Web APIs, entirely out of ready-made Web Components, like out of Lego bricks, almost with no code, and publish it on Google Firebase.",
        "speakers": [
            "AlexeyRodionov"
        ]
    },
    {
        "date": "2019-11-29",
        "timeStart": "15:00",
        "timeEnd": "16:00",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Discussion panel WTM",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Intermediate",
        "description": "Discussion panel WTM",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-29",
        "timeStart": "16:00",
        "timeEnd": "17:00",
        "lang": "Ru",
        "location": "Big room, 2nd floor",
        "title": "Discussion panel about the startups",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Intermediate",
        "description": "Discussion panel about the startups",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-29",
        "timeStart": "17:00",
        "timeEnd": "19:00",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "Cross-platform in 2019: C++ as an antagonist in a progressive world: workshop",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Intermediate",
        "description": "In C++, there are a sufficient number of fundamental nuances due to the proximity to bare metal:<br>1. Undefined Behavior<br>2. Use After Free<br>3. Memory Corruption<br>4. Stack/Heap/Global Buffer Overflow<br>5. Use After Scope<br>6. Init Order<br>7. Memory leaks<br>And this is far from the limit. All of them can shoot very violently and painfully with the most incomprehensible outcome for the uninitiated in the language, because of which there is a need to somehow monitor, diagnose and solve such problems.<br>In this session, we will try to understood all cases on real cross-platform code, try to write our own and debug it properly.",
        "speakers": [
            "AlexanderEfremenkov"
        ]
    },
    {
        "date": "2019-11-29",
        "timeStart": "19:00",
        "timeEnd": "21:00",
        "lang": "",
        "location": "",
        "title": "Pre-party",
        "talkTypeBadge": "",
        "talkLevelBadge": "",
        "description": "Pre-party",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "09:00",
        "timeEnd": "10:30",
        "lang": "",
        "location": "Halls",
        "title": "Check-in",
        "talkTypeBadge": "",
        "talkLevelBadge": "",
        "description": "Check-in",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "09:00",
        "timeEnd": "10:30",
        "lang": "",
        "location": "Halls",
        "title": "Coffee-break",
        "talkTypeBadge": "",
        "talkLevelBadge": "",
        "description": "Coffee-break",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "10:30",
        "timeEnd": "10:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Opening",
        "talkTypeBadge": "",
        "talkLevelBadge": "",
        "description": "Opening",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "11:00",
        "timeEnd": "11:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Data-Driven Frontend Components and the New Jira Navigation",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "In large frontend codebases, concise components are the key for the success of your application. Decisions can be done based on the user journey: better ways to improve performance by code-splitting, memory consumption, flexibility or even A/B testing. What if we can use a data-driven approach in a component level and mitigating any possible risk involved?<br>In this talk, I will share my experience and decisions using hypothesis and data-driven development effectively to release the new navigation in Jira, the most famous project management in the world! How to use some component patterns for A/B testing, performance and bundle size improvements and all the journey around the new navigation in Jira.",
        "speakers": [
            "WillMendes"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "11:00",
        "timeEnd": "11:50",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "Why we’ve picked Flutter for our “Next big thing”",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Intermediate",
        "description": "We’ll discuss why we’ve picked flutter for our mission critical project, what other technologies were considered, and where are we now with this decision.  I will show all the stats we have measured while developing the app, and tell about problems we’ve encountered.",
        "speakers": [
            "GennadyEvstratov"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "11:00",
        "timeEnd": "11:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "Roles and positions in Data Science. How to join?",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Beginner",
        "description": "You have development experience and are interested in Data Science.  Maybe you got a couple of courses and participate in hackathons. What to do next?  There are many different roles in DS. What is expected from each of them, what are the requirements - and, most importantly, how to prepare for interviews?<br>I’ll tell you about the differences between Data Scientist, Data Analyst and ML Engineer, about how they interact with each other within companies.  And, of course, I’ll touch on what skills are required and how to train them.<br>",
        "speakers": [
            "VladGrozin"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "11:00",
        "timeEnd": "11:50",
        "lang": "En",
        "location": "Room #3, 3d floor",
        "title": "DevOps: A Love Story",
        "talkTypeBadge": "DevOps",
        "talkLevelBadge": "Intermediate",
        "description": "This romance involves the partnership of Docker, Kubernetes, and Jenkins. These technologies are a huge part of the DevOps movement, and are making the heart of many development teams flutter. Let me introduce you to these three. You're going to fall head over heels.<br>During this presentation we will cover a high-level overview of concepts such as DevOps Culture, containers, build pipelines, pods, clusters, CI/CD, and means of automation. At the end, you should walk away with a fundamental understanding of the world of auto-magic!",
        "speakers": [
            "ValarieRegas"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "12:00",
        "timeEnd": "12:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "Vue.js v3. The new generation of front-end frameworks.",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "Just imagine a whole new world with fast responsive and lightweight web applications you've ever seen. Front end developers don't only write code for% frameworkName% but also know what they do and how it works. A lot of them. Lets discuss how the new front-end generation brings part of this magic world to reality.",
        "speakers": [
            "IgorSheko"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "12:00",
        "timeEnd": "12:50",
        "lang": "Ru",
        "location": "Room #3, 3d floor",
        "title": "Practical mapping in Android apps development",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Intermediate",
        "description": "We will talk about converting one object to another one. Let's consider different approaches to solving the mapping issue and existing implementations of these approaches. I will review the applicability of these solutions in the android applications development and show how to write yet another tool for generating mapping code.",
        "speakers": [
            "AndrewMihin"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "12:00",
        "timeEnd": "12:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "Lock, stock, ALS: recommending ads at Yandex.Zen",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Intermediate",
        "description": "Yandex.Zen is a personalised recommendations feed which finds interesting and unique content for its users. <br>Using Zen’s recommendations engine, we are currently building a new-generation ad platform, which aims at being both interesting to our users and effective for our advertisers.<br>In this talk, I’ll describe how we launched our ad platform from a ML perspective:<br> ⁃ How our ads recommendations pipeline works;<br> ⁃ Challenges we were faced with;<br> ⁃ Simple and efficient ML solutions which helped us increase ad full reads by 50%;<br> ⁃ Just how crucial the right training target is;<br> ⁃ And some new challenges that lie before us.<br>Want to teach ML algorithms how to make money? Come join us to discuss how we do it at Zen.",
        "speakers": [
            "BorisSharchilev"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "12:00",
        "timeEnd": "12:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Cloud Native, Service-Meshed Java Enterprise With Istio",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "In enterprise software, we see more and more of the cloud native technologies, especially container orchestration and service meshes, emerging and slowly taking over the market. Developers are facing the challenge which technology to choose to implement microservices for a cloud native setting. Java Enterprise has been used for software solutions for a long time and its APIs are well-established in the ecosystem. However, is it possible to develop cloud native, service-meshed Java Enterprise applications that fulfill concerns such as scalability, resiliency, and telemetry — in an effective, manageable way?<br>This session shows how to implement service-meshed applications using Jakarta EE 8 and MicroProfile. We will develop a mesh of microservices, managed by Kubernetes and Istio. We’ll see why especially the Java Enterprise approach fits the concepts behind container orchestration and service meshes well. The session also includes how to integrate the required cross-cutting concerns, such as monitoring, tracing, or resiliency into our applications, where developers have to actively integrate technology themselves and where the platform supports us. Especially the cooperation between Jakarta EE and MicroProfile provides a potent technology. All of the time will be spent live-coding while explaining the concepts and solutions.",
        "speakers": [
            "SebastianDaschner"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "13:00",
        "timeEnd": "13:50",
        "lang": "",
        "location": "Canteen",
        "title": "Lunch",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "",
        "description": "Lunch",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "13:00",
        "timeEnd": "13:50",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "Cross-platform in 2019: C++ as an antagonist in a progressive world",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Intermediate",
        "description": "To date, the cross-platform development ecosystem has a sufficient number of frameworks for mobile<br>platforms: Flutter, Kotlin Native, React Native, Xamarin, Cordova.<br>But there are those technologies that receive less attention, one of which is C ++.<br>In this session, we will talk about what kind of compromise each of the approaches has,<br>see how the C ++ developer lives on mobile platforms in 2019 and how to avoid troubles when<br>developing in this language.",
        "speakers": [
            "AlexanderEfremenkov"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "13:00",
        "timeEnd": "13:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "Spark и Zeppelin; What's in your code? Exploring the code with Big Data",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Beginner",
        "description": "In this talk, we'll take Spark, Zeppelin, and Big Data Tools from JetBrains and explore the source code for Intellij IDEA Community. Using Big Data, we learn interesting patterns in writing code and find the statistical differences between Kotlin code and Java code.",
        "speakers": [
            "NikitaAshikhmin"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "13:00",
        "timeEnd": "13:50",
        "lang": "",
        "location": "Canteen",
        "title": "Lunch",
        "talkTypeBadge": "DevOps",
        "talkLevelBadge": "",
        "description": "Lunch",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "14:00",
        "timeEnd": "14:50",
        "lang": "Ru",
        "location": "Big room, 2nd floor",
        "title": "PWA/TWA Uncensored",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "Nobody tell about drawbacks and problems at tech conferences and product presentations.<br>I’ll tell about problems that we encountered in our startup “GdeZerno” (“Uber” for grain trucks) while developing, launching and operating in production for more than 2 years the first in Russia commercial Progressive Web App (PWA) and Trusted Web Activity (TWA), built entirely out of Web Components using Google Polymer (and later Google LitElement) on front-end and Google Firebase (and later Prisma GraphQL) on back-end, how we have solved these problems, and how eventually have had an impact on the Web platform and GraphQL ecosystem.",
        "speakers": [
            "AlexeyRodionov"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "14:00",
        "timeEnd": "14:50",
        "lang": "",
        "location": "Canteen",
        "title": "Lunch",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "",
        "description": "Lunch",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "14:00",
        "timeEnd": "14:50",
        "lang": "",
        "location": "Canteen",
        "title": "Lunch",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "",
        "description": "Lunch",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "14:00",
        "timeEnd": "14:50",
        "lang": "En",
        "location": "Room #1, 2nd floor",
        "title": "The platform is dead, long live the platform",
        "talkTypeBadge": "DevOps",
        "talkLevelBadge": "Intermediate",
        "description": "Out with the old, in with the new. Replacing a functioning platform with shiny containerized automated goodness.<br>When companies evolve, their tech stacks need to as well. But sometimes you realize every single part of the machine needs evolving, and you're better off scrapping the entire thing.<br>Zero downtime migration from a legacy stack based on Jenkins, Ansible, Icinga, HAproxy, nginx, uwsgi, pypi, and Tomcat to a new one based on Travis, Docker, CloudFormation and ECS/Fargate with assorted tech debt solved on the way there.<br>A high level overview of current tech, leaning towards the serverless trend by having 0 self-managed resources (classic servers). Talk will focus on AWS offerings but is applicable to most of the popular public clouds.<br>It's basically a rich man's Heroku, with all the flexibility you might possibly need, while avoiding scary tech like Kubernetes which nobody wants to really learn how to manage properly.",
        "speakers": [
            "LukaKladaric"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "15:00",
        "timeEnd": "15:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "You might not need classes",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "Classes in JavaScript are problematic in a few important ways that many people are still not aware of, and they don't really have much advantages over alternative patterns based on just functions. Let's show the audience how to simplify their codebases by taking advantage of function composition!<br>More than three years later, the introduction of classes to the ECMAScript standard is still a controversial topic. Brought over from popular classical object-oriented languages, they've not only been argued an unnecessary feature for JavaScript, but their usage can become actually harmful very easily. In this talk we'll take a look at the potential issues and pitfalls of using classes, like the need for context binding of methods, and suggest alternative patterns that are conceptually simpler, easier to work with, safer to use, more idiomatic, require less code and are actually more powerful.",
        "speakers": [
            "RamonGuijarro"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "15:00",
        "timeEnd": "15:50",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "Android Animations in 2k19",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Intermediate",
        "description": "Over the years, Android has accumulated many different ways to work with animations, and over the past two years, approaches have changed dramatically, but not all of them are good in practice.<br>In the report, you will hear how to approach the choice of constructing animations so that complex animations are easy to develop and operate.",
        "speakers": [
            "AlexanderSmirnov"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "15:00",
        "timeEnd": "15:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "From SentEval to SentEvalRu: semantic sentence vectors for problems of analysis of Russian texts and an automatic quality evaluation",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Intermediate",
        "description": "Embeddings of sentences are used wherever tasks of computer linguistics are solved or used, for example:<br> - classification of user intentions in chatbots (intent classifier);<br> - use in dialog systems to search for an answer to a user's question closest in meaning;<br> - embedding web content in parsers to analyze sentiment of text (sentiment analyses);<br> - giving a machine translation;<br> - tasks of clustering documents.<br><br> In my report I will talk about popular types of embeddings and about what language models are there for the Russian language.  We will also discuss the tasks on which their quality can be assessed, and see which vector representations work better on each of them.<br>",
        "speakers": [
            "AnnaMosolova"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "15:00",
        "timeEnd": "15:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "Integration Tests in Go",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "In our world of distributed systems, there are many relationships between components. A mistake in at least one interaction can lead to the degradation of the system and loss of company profits. The coverage with integration tests reduces risk, the value of integration testing increases. But it does not receive proper attention (such as unit testing, which Go programmers have in genes). We at Badoo set out to write integration tests on Go, and we succeed it.<br>In the report, we will consider what integration testing means, how to implement the Go framework for it, what kind of difficulties we faced, and what results were achieved. You find that writing integration tests on Go is real and not so painful.<br>Plan<br>1. Why integration tests are needed<br>2. How to raise the infrastructure<br>3. How to prepare the service before a start<br>4. Parallel launch of services<br>5. Waiting for service availability<br>6. Work with infrastructure in the test<br>7. How to debug tests<br>8. What does the test framework look like?",
        "speakers": [
            "KseniaYakil"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "16:00",
        "timeEnd": "16:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "To be announced",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Intermediate",
        "description": "TBA",
        "speakers": [
            "JaniEvakallio"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "16:00",
        "timeEnd": "16:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "The definitive guide to make software fail on ARM64",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "Adopting a second CPU architecture into x86-only infrastructure can be a challenging task: not only you have to find the right hardware and to learn how to properly provision it, but you also need to port the whole software stack, which was probably developed and improved for a number of years without having this second architecture in mind.<br>And even though you might think that all the components of your stack are written in a cross-platform architecture agnostic language (like Go or Java), there are still many ways they can fail on a secondary architecture after porting. This presentation describes the issues we encountered, when porting our software to ARM64 and provides some advice for developers on how to avoid them, when writing new code.",
        "speakers": [
            "IgnatKorchagin"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "16:00",
        "timeEnd": "16:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "Automated methods for building taxonomies from texts",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Intermediate",
        "description": "To improve the quality of automatic text processing, you often need to use lexical knowledge (synonyms, antonyms, etc.) and knowledge about the subject area.<br> To represent such knowledge, specialized computer resources are created manually: taxonomies,<br> ontologies, thesauruses, and the question often arises of how much automation of knowledge extraction from text collections can be automated.<br> The report will examine well-known lexical and semantic resources for automatic text processing, and will also describe various tests and their results for the automatic extraction of genus-species (taxonomic) relationships from text collections.",
        "speakers": [
            "NataliaLukashevich"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "16:00",
        "timeEnd": "16:50",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "WebRTC Internals",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "WebRTC Internals<br> - analysis of WebRTC components<br> - using WebRTC on the server<br> - bandwidth estimation algorithms and network models",
        "speakers": [
            "IlyaShcherbak"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "17:00",
        "timeEnd": "17:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "Bayesian deep learning for text and speech recognition",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Advanced",
        "description": "TBA",
        "speakers": [
            "IvanBondarenko"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "17:00",
        "timeEnd": "17:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Testing Web Accessibility",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Advanced",
        "description": "When we develop a new web application, we often put a lot of work on the design, on making it beautiful and usable. In other words, we want our web app to be effective, efficient, and satisfying for the user. But a lot of times we don’t think about the user experience for people with disabilities, including people with age-related impairments.<br>For the web, accessibility (a11y ) means that people with disabilities can perceive, understand, navigate, and interact with websites and tools, and that they can contribute equally without barriers.” (Source: W3C - Web Accessibility Initiative). Our role as frontend and web developers is to create clear interfaces to make people understand and care about data, independently of their disabilities or impairments, but what we, developers, often forget is to ensure that the code we write follows the Web Content Accessibility Guidelines (WCAG), and the only way to achieve that is testing, either manual or automated. \\r\\n\\r\\nAutomated web a11y tests can free up our QA team from manual testing every part of our application…but…they can’t automatically, and magically, make our site accessible.\\r\\n\\r\\nWe should use automated a11y tests as one step of a larger testing process. Don’t forget that only 20% to 50% of all accessibility issues can automatically be detected.<br>I will show you some testing tools, libraries and techniques to increase the a11y test coverage of your code with a simple React application example.",
        "speakers": [
            "AdrianBolonio"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "17:00",
        "timeEnd": "17:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "How to build a hippy trap",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Intermediate",
        "description": "Take one musician, one practitioner in the ancient art of Japanese rope bondage, a haptic VR entrepreneur and a couple of software engineers. Stir in a shared passion for art, and sprinkle with dust. This is the story of how we created one of the most loved \\playa\\ installations at a European Burning Man event in 2019 – a new kind of spatial musical instrument allowing the audience to play a desert symphony on a rope art piece. In my talk, you'll come along on our creative journey from idea (+ blood, sweat and tears), to technical implementation. I'll then show you how you can contribute your own desert performance to the project (with just a few lines of Javascript!).",
        "speakers": [
            "EkaterinaLoschinina"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "17:00",
        "timeEnd": "17:50",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "GraphQL. Moving from REST in a large project",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "REST is almost a synonym for the web API. But it is not always possible to do RESTful API quickly and nicely looking inside and out. Especially on the the first try. We launched a new project recently and we learnt it the hard way.<br>Then we decided not to waste second version on refactoring and rewriting same architecture but to dig deeper. What if REST itself is not fully suited for our team?<br>This is when we took a look at the GraphQL. And very much liked it!<br>This will be a talk about differences in approaches between REST and GraphQL and how hard it is to move from one to another.",
        "speakers": [
            "DenisYuriev"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "18:00",
        "timeEnd": "18:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "The other side of webapp security",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "Protecting your backend and database is fine, but what about the users? How do we protect them, their browsers and computers?<br>There's a lot of focus on backend security, best practices, how to store passwords, how to do password recovery, encryption at rest, etc. But to exploit any of those someone needs to target a website specifically, and put a lot of effort into it.<br>But the users of those websites are exposed every day, and they access them through various insecure networks, including hotel and coffee shop wifi.<br>In this talk we will cover the usual suspects: HTTPS and certificates, but also talk about some newer tech like HSTS and CSP.",
        "speakers": [
            "LukaKladaric"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "18:00",
        "timeEnd": "18:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "How to sell yourself for fun and profit",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Beginner",
        "description": "As it would seem, why does a developer need a personal brand? Just sitting, no one touching, fixing the primus. The less they know him, the less they touch them, right?<br>But here's the thing: according to researches, the best way to raise wage is to change the work. And during the interview publicity and personal brand are half the battle! And when it comes to hiring good personal brand management will give 100 points ahead to any cookies with ping-pong.<br>In this talk, Baruch will tell how it happened that you know who Baruch is, how this knowledge is converted to profit for Baruch and how you can repeat his success.",
        "speakers": [
            "BaruchSadogursky"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "18:00",
        "timeEnd": "18:50",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "SpaCy-RU: fast neural networks for text analysis",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Intermediate",
        "description": "Задачи обработки текста бывают очень разными, но наиболее частые из них - это разбиение текста на слова и предложения, синтаксический разбор и выделение имён и названий людей и организаций.<br>Мы поговорим о библиотеке spacy -- популярном нейросетевом многоязычном инструменте для решения этих задач, и о её русской версии.<br>Мы разберём как внутреннее устройство, так и некоторые практические аспекты использования библиотеки для решения ваших задач.",
        "speakers": [
            "YuriBaburov"
        ]
    },
    {
        "date": "2019-11-30",
        "timeStart": "19:20",
        "timeEnd": "21:30",
        "lang": "",
        "location": "Canteen",
        "title": "After-party",
        "talkTypeBadge": "",
        "talkLevelBadge": "",
        "description": "After-party",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "10:00",
        "timeEnd": "10:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "How to become a Data Scientist: guide for developer, scientist, student.",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Beginner",
        "description": "Nowadays, from all sides we hear about machine learning (and AI). Many are already working as Scientists, others are thinking about how to become them. I will try to answer the questions: Is it worth it? What is it really about? How to make the transition? Let me tell you our 3-year CFT story.",
        "speakers": [
            "IvanKomarov"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "10:00",
        "timeEnd": "10:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Cloud Composer: simplifying complex workflows with a powerful orchestrator on GCP",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "We'll dive deep into what's under the hood. Then unleash its immense power by looking at what it can do:<br>- internals: celery, redis, GKE, GCS, SQL<br>- concepts: DAG, operator, workflow, operator, hook, xcom and more<br>- customizing: custom operators, custom sensors, custom deployment<br>- GCP perks: private IPs, VPC native, KubernetesPodOperator, Stackdriver<br>- use cases: CICD, infrastructure, ETL, ML workflow and complex data pipelines<br>- integrations: terraform, slack, etc",
        "speakers": [
            "VsevolodHrechaniuk"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "10:00",
        "timeEnd": "10:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "When there are too many microservices, or why did we make our chat solution a monolith",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "Sometimes you look at something, and say to yourself: oh, this is too much. This happened to us too. We decided to do something about it. The result was not what we expected. By the way, monolyth is a lie :D",
        "speakers": [
            "IgorDultsev"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "10:00",
        "timeEnd": "10:50",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "Accessibility in a banking application: how we make Rocketbank convenient for everyone",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Intermediate",
        "description": "TBA",
        "speakers": [
            "NarekChanglian"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "11:00",
        "timeEnd": "11:50",
        "lang": "En",
        "location": "Room #2, 2nd floor",
        "title": "How not to suck at mobile app development?",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Intermediate",
        "description": "With every year, there is an exponential increase in the number of mobile apps being developed. With this rate of growth, it is the right time to talk about security in mobile apps! In rare cases, developers think about security but on the other hand, consumers think that developers would have taken care of it. We need to teach our developers to think about app security upfront and include security in their development lifecycle. And this is important to retain the consumer trust if you want to stay in this game for long.<br>Mobile application security is one of the primary concerns as the data residing within the app could put users at risk. Every single developer needs to have a basic understanding of application security. You need to understand why it is important not to log sensitive data. You need to understand why it is important to use proguard to avoid reverse engineering. And you must rethink about insecure data storage and much more.<br>If you are a developer who develops a mobile application, chances are that you would have never thought about security. You must have been busy all the time thinking about UI/UX, cool shiny buttons, and whatnot! But very often we forget to think about security. If you don't work with mobile app security on a daily basis, chances are that you might feel stuck when it comes to dealing with sensitive data that cannot be exposed to third parties.<br>Common vulnerabilities in mobile applications include architectural flaws, platform weakness, isolation and permission problems and of course application weakness! This talk is targeted to developers who are already developing mobile apps for Android or maybe plan to. This talk, however, assumes that you know how to build and deploy mobile apps.<br>The real question is, how do enterprise or individuals avoid security challenges to protect their mobile apps? Enterprise and Indie developers of today must comprehend the next-generation cybersecurity best practices to safeguard the mobile apps and data within. And this talk will give you a brief idea about how to implement secure practices for your next mobile apps, or if you have any, already, implementing them on your existing mobile app!<br>There is a number of best practices for your mobile app security, this talk will focus on a few of them. So after the end of this talk, you would be in the position to implement some of them and make your app more trustworthy. This talk will teach you how to ensure that you are writing a vulnerability-free code!<br>This talk will give a brief insight on the OWASP top 10 mobile app vulnerabilities and how not to have them inside your next billion $$$ app.",
        "speakers": [
            "YogeshOjha"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "11:00",
        "timeEnd": "11:50",
        "lang": "En",
        "location": "Room #1, 2nd floor",
        "title": "DevOps patterns and antipatterns for continuous software updates",
        "talkTypeBadge": "DevOps",
        "talkLevelBadge": "Beginner",
        "description": "So, you want to update the software for your user, be it the nodes in your K8s cluster, a browser on user’s desktop, an app in user’s smartphone or even a user’s car. What can possibly go wrong?<br>In this talk, we’ll analyze real-world software update fails and how multiple DevOps patterns, that fit a variety of scenarios, could have saved the developers. Manually making sure that everything works before sending update and expecting the user to do acceptance tests before they update is most definitely not on the list of such patterns.<br>Join us for some awesome and scary continuous update horror stories and some obvious (and some not so obvious) proven ideas for improvement and best practices you can start following tomorrow.",
        "speakers": [
            "BaruchSadogursky"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "11:00",
        "timeEnd": "11:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Getting more with design tokens",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "Design tokens, a mysterious remedy for the most severe pains of working with design systems. I will show the basic use cases of design tokens and perform a live demo of syncing designs with code in real time. I will also share all the resources necessary to start using this concept in your own work.",
        "speakers": [
            "MikolajDobrucki"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "11:00",
        "timeEnd": "11:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "Musket - painless start with Deep Learning",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Intermediate",
        "description": "Deep learning development approaches differ from the classic software development in a lot of ways. While migrating our developers to this new area we encountered many issues we want to talk about. Our company specializes in developer tools creation, so that was our instinctive reaction to create the programming language with tooling ecosystem and interactive development environment that boosts the start for newcomers and reduces the amount of untracked mistakes, as well as helps to track the whole experimentation and data analysis efforts. We will provide quick overview of classic DL tasks and demonstrate the resolution process for a practical example using several different approaches.",
        "speakers": [
            "DenisDenisenko,PavelPetrochenko"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "12:00",
        "timeEnd": "12:50",
        "lang": "Ru",
        "location": "Room #2, 2nd floor",
        "title": "Dispelling DiffUtil magic ",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "Intermediate",
        "description": "Each Android developer used RecyclerView to display lists in their Apps, and each faced with the problem of updating the data in the adapter until the magic class DiffUtil appeared in 2016. I will explain “on fingers” how it actually works and try to dispel its magic.<br>If you already read my article on the habr, there is still a lot of new information about DiffUtil. On my meetup you will learn not only about Myers algorithm, but about everything occurs after it: how DiffUtil searchs movements, how change flags works, how changes apply to the Adapter using these flags.",
        "speakers": [
            "PetrKozlov"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "12:00",
        "timeEnd": "12:50",
        "lang": "Ru",
        "location": "Big room, 2nd floor",
        "title": "Serverless and Functions as a Service (FaaS). How to build modern backend for PWA and mobile apps",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "In this talk Sergey will show how to use serverless approach to implement modern backends for web and mobile apps. We will consider FaaS (functions as a service) based on AWS Lambda and GraphQL APIs with AWS AppSync. Sergey will show how to use popular frameworks for AWS Lambda to do fast prototyping and achieve unlimited scalability.",
        "speakers": [
            "SergeyPugachev"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "12:00",
        "timeEnd": "12:50",
        "lang": "En",
        "location": "Room #1, 2nd floor",
        "title": "Go for frontend",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "Ever wanted to use Go to unleash your creative side? \\nThis talk is for developers who want to write front end code purely in Go, using web assembly and vugu.<br>It introduces the audience to creating beautiful, exciting apps and graphics, all running in the browser.<br>After attending JSConf and seeing all the amazing, creative presentations, I decided it was time to use Go in a more creative manner.<br>In this talk I introduce frontend development for Go and how to make beautiful components and websites purely in Go. The technologies touched on will be WebAssembly and vugu.<br>I will also demo one of my personal projects built purely in Go, running completely in the browser.<br>This talk also briefly touches on contributing to vugu, an experimental front end framework. ",
        "speakers": [
            "AarushiKansal"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "13:00",
        "timeEnd": "13:50",
        "lang": "",
        "location": "Room #3, 3d floor",
        "title": "Lunch",
        "talkTypeBadge": "Mobile",
        "talkLevelBadge": "",
        "description": "Lunch",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "13:00",
        "timeEnd": "13:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Angular Schematics - develop for developers",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "Schematics is an underestimated part of Angular project. By using them, library developers gain super-powers to helping their customers. You can adjust your customer projects with changes necessary to use the library you provide. Apart from that, Schematics is a great tool for enterprise, which needs to maintain UI elements on behalf of multiple dev-teams.<br>In this talk, I am going to start from a high-overview of schematics framework, used by Angular CLI. Audience would get familiar with the Tree and Rule objects concept. I want to show a working example of create, read, update and delete operations, performed by schematics, how can you make  use of TypeScript compiler and how to send a task like package installation to NodeJS.<br>What will be covered here, are ‚ng add’, ‚ng update’, ’ng new’, ‚ng generate’ etc. etc. commands, together with best practices, how to perform a unit tests, and end-to-end tests with the use of tools like mock npm registry.",
        "speakers": [
            "MaciejTreder"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "13:00",
        "timeEnd": "13:50",
        "lang": "",
        "location": "Room #1, 2nd floor",
        "title": "Lunch",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "",
        "description": "Lunch",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "13:00",
        "timeEnd": "13:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "Automatic Machine Learning: State of the art",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Intermediate",
        "description": "The data analyst spends the most time on enumerating models and setting up their hyperparameters. Automatic machine learning attempts to automate both of these processes. Over the past few years, this topic began to the hype at the same speed as deep learning in its time. In this topic, I will talk about the main areas that are called automatic ML, as well as speculate on whether artificial intelligence will replace data analysts in the next few years.",
        "speakers": [
            "AndreyFilchenkov"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "14:00",
        "timeEnd": "14:50",
        "lang": "En",
        "location": "Room #2, 2nd floor",
        "title": "No Bulls*it Freelancer",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Intermediate",
        "description": "I am a product designer by day and Stand up comedian by night. But more importantly - I am a freelancer, and now is the time you should be one too. This is a talk where I will share how I was growing and managing two parallel careers. What is it actually like to work for yourself and what to do with this newfound freedom? I talk about growing as professional, share all the good and the bad from my experience. How I do it, and is it all worth it.",
        "speakers": [
            "TomKozacinski"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "14:00",
        "timeEnd": "14:50",
        "lang": "",
        "location": "Big room, 2nd floor",
        "title": "Lunch",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "",
        "description": "Lunch",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "14:00",
        "timeEnd": "14:50",
        "lang": "En",
        "location": "Room #1, 2nd floor",
        "title": "Where is my cache? Architectural patterns for caching microservices by example",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "Everybody knows that we need a cache, but where exactly to put it? Inside your application or as a layer in front of it? In the container or outside the container? In the era of Cloud and Microservices these questions get even more complicated. In this session, I'll present different architectural patterns for distributed caching: Embedded, Client-Server, (Kubernetes) Sidecar, and Proxy Caching.",
        "speakers": [
            "RafalLeszko"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "14:00",
        "timeEnd": "14:50",
        "lang": "",
        "location": "13th floor",
        "title": "Lunch",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "",
        "description": "Lunch",
        "speakers": [
            "TBA"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "15:00",
        "timeEnd": "15:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "Smart Railways with GCP and IoT",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Intermediate",
        "description": "How many devices have internet access? Million, ten, maybe 50 billion? No, this is not a joke when it comes to the Internet of Things!<br>History and potential of IoT, problems and its modern methods of solving and smart railway with Google Cloud Platform.",
        "speakers": [
            "VladimirDaron"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "15:00",
        "timeEnd": "15:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "Neural Architecture Search in a small company",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Advanced",
        "description": "It is not a secret that these days neural networks is an optimal method for processing images, sound, and texts. However, NN quality highly depends from the order we apply one or another operation. So, what to do in such situation? How to automate the NN architecture building process? My talk will be exactly about this. At first, I will cover state-of-the-art approaches and then will move to the problems which I experienced myself while developing my NN algorithm.<br>",
        "speakers": [
            "AlexanderGoncharenko"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "15:00",
        "timeEnd": "15:50",
        "lang": "Ru",
        "location": "Big room, 2nd floor",
        "title": "Video in web from flash to MSE or writing your own video-player",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "I will talk about evolution of video related APIs from Flash to MSE, about nowaday approaches and APIs used by the majority of video hosting services and technologies you need to know if you want to create your own video streaming service.<br>Most emphasis will be placed on modern video streaming formats and principles of their work, as well as on browser APIs that are needed to support them. We will also cover cover video-specific analytics and quality assessment.",
        "speakers": [
            "AlexeyGusev"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "15:00",
        "timeEnd": "15:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "What makes a database unique: Tarantool's best fist.",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "Patterns and anti-patterns exist not only in programming,<br>but also in working with data, and databases... When an application is data-intensive, a mistake in data modelling can lead to huge costs in production, and put a roadblock in the path of further feature development.<br>Many programmers start their journey into data modelling with  relational databases, which provide a centralized worldview of  data. The learned assumptions and paradigms that come with RDBMS carry over from project to project, throughout their career.<br>Opinion wars happen regularly, but they rarely lead to people using the best tool for the job.<br>In this talk I will present a few patterns for data modelling, showcasing the areas in which Tarantool, a feature-rich, fast data platform, uniquely shines: processing highly volatile, highly connected, transactional data.",
        "speakers": [
            "KonstantinOsipov"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "16:00",
        "timeEnd": "16:50",
        "lang": "En",
        "location": "Room #1, 2nd floor",
        "title": "Managing ML Lifecycle - DevOps for ML",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Advanced",
        "description": "Creating an ML model is just a starting point. To bring it into production, you need to solve various real-world issues, such as building a pipeline for continuous training, automated validation of the model, scalable serving infrastructure, and supporting multiple environments in increasingly common multi-cloud setups. In this session, we will learn the concept of ML Ops (DevOps for ML) and how to leverage TFX, Kubeflow Pipelines to build and maintain production quality ML systems.<br>In this session we will also see a demo of Creating a model, deploying and moving the model over multiple environments.<br>It is my impression that the world of deep learning research is starting to plateau. What's booming: deploying DL to real-world problems.<br>-François Chollet",
        "speakers": [
            "VasudevMaduri"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "16:00",
        "timeEnd": "16:50",
        "lang": "Ru",
        "location": "Big room, 2nd floor",
        "title": "The Holy Graal: running React in Java",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "The story about our migration path. How we started to use modern JS stack in Java world with GraalVM runtime.",
        "speakers": [
            "OlegKorovin"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "16:00",
        "timeEnd": "16:50",
        "lang": "En",
        "location": "13th floor",
        "title": "SEO: de Marketing a Data Science.",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Intermediate",
        "description": "SEO (Search Engine Optimization) is the practice of increasing the quantity<br>and quality of traffic to your website<br>through organic search engine results.<br>Agenda:<br>- SEO<br>- SEO Experimentation<br>- Framework: Causal Impact (a Google model)<br>- Example of A/B test",
        "speakers": [
            "PabloPerezDeAngelis"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "16:00",
        "timeEnd": "16:50",
        "lang": "En",
        "location": "Room #1, 2nd floor",
        "title": "Distributed Domain Destruction",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "For the last couple of years I have been building, maintaining and fighting a projects that make use of distributed computing, parallel processing, message brokers, queues and workers. This is one of those from thetrenches talks, where I will regale you with tales about the series of unfortunate events that may happen as your application grows in complexity. Tales like disk space fluctuations, importance of logging, NoSQL problems, restructuring your order of execution in code for performance gains, short sighted albeit logical architectural decisions that will cost you in the long run.",
        "speakers": [
            "SrdjanVranac"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "17:00",
        "timeEnd": "17:50",
        "lang": "En",
        "location": "Room #2, 2nd floor",
        "title": "Build your own Internet of Continuously Delivered Things",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Advanced",
        "description": "We all know that a modern tester should have both analytical skills and basic knowledge of programming as well as soft skills. If we add experience in agile software development, we get an almost perfect candidate in the eyes of employers. However, what if one day your employer says:\\r\\n\\r\\n+ Our sensor has been recently working too short.<br>+ Please, do the battery life tests. <br>+ Current functionalities of our product will be enhanced soon. Please, write some tests for the embedded platform.<br>+ Clients are complaining about our system working too slowly. Please, prepare the testing environment for performance tests of microprocessor memory.<br>Nowadays, everything tends to deliver high-quality products in a continuous way. How to test an application for your customer with so many tools, equipment, and ecosystems combining HW, FW, mobile devices and complex backend architecture? Over the past few years, I've already gone three times through the transformation from \\QA Team\\ thinking to \\Dev/TestOps\\ mindset in IoT companies.<br>During my presentation, I'll show you how to implement a multi-node system (HW/FW/SW) in the environment of Continuous Integration and (finally) Continuous Delivery. I will start with a big picture of a centralized automated test environment. After that, all components will be separately analyzed to present possible solutions and implementations. I will also show how to involve manual testers and let actively participate in the environment evolution. All of that supported by Jenkins tool, Python language, BDD approach and some HW knowledge.",
        "speakers": [
            "DawidPacia"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "17:00",
        "timeEnd": "17:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Paste Wars: fighting for copypaste freedom",
        "talkTypeBadge": "Web",
        "talkLevelBadge": "Intermediate",
        "description": "No one knows where it came from, but it is spreading like a disease: blocking paste functionality on online password forms. There is no explanation, no research, just a typical “this is for your security…”. And yet, all this is in the age of almost defeating the threat of weak and reused passwords by adopting password managers.<br>Some try to fight back: Firefox, for example, allows users to disable the block by completely turning off paste notifications. However, this is like cracking a nut with a sledgehammer, as there may be many other legitimate use-cases for sites to handle paste events.<br>There are also some browser plugins: they go as far as scanning the whole DOM and removing the blocker code or injecting passwords directly into the page. But these come not without risks: unveiling passwords and full browsing history to third-party applications (which, by the way, have full network access). Also, users are limited in the choice of their browser, as these plugins are often not portable.<br>It feels a bit wrong when a website (or anyone else) decides what users can or cannot do on their computers. However, there is hope: instead of fighting paste blockers, why not just provide the password in the “natural” way they expect—by typing it in. But the typing will be done by the user’s operating system, rather than the user himself: the OS can automatically type a very complex password from any password manager for you. And paste blockers can never block it—because this is the only way they should allow the password to get in, by design.<br>These ‘Paste Wars’ are over: introducing a simple tool, which can type in complex passwords and restore users’ rights to paste!",
        "speakers": [
            "IgnatKorchagin"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "17:00",
        "timeEnd": "17:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "Code as literature.",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "A lot of people spoke and wrote a lot about how to write good code. Thousands of them, maybe even hundreds of thousands. <br>But there is a huge piece of dark matter - why is it hard to read some programs? The work fast, well-formatted and commonly use best practices, but it is hard to read them, physiologically (and also psychologically) hard. In most cases, when you want to stop reading the code and take some break it is not procrastination but someone's bad-done job. <br>It sounds obvious that the code that we write should be comfortable to read and a lot of those best practices try to take this into account, but the focused on different things. Most of the programmers didn`t even think about their code as literature.<br>So, let's think about it. Why someone writes code like Fridrich Nitsche and why someone writes like Kenneth Grahame? Why some code as sophisticated as tax law and other as clear as a fifth-grade essay? Why some code makes you cry before you find a bug and why some code logical as subway map(well... some subway maps)?<br>Encephalograms to make you feel your self as a scientist included.",
        "speakers": [
            "FedorSavkin"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "17:00",
        "timeEnd": "17:50",
        "lang": "Ru",
        "location": "13th floor",
        "title": "Zero- and Few-Shot Learning in Natural Language Understanding",
        "talkTypeBadge": "Data Science",
        "talkLevelBadge": "Intermediate",
        "description": "Here, at Huawei, we are solving different real-world tasks. Our team spends most of our time on dialog systems.<br>One of the problems we are solving is how to choose the right skill in each situation. And more interestingly, what if we have (almost) no training set? Traditionally, for such tasks TF-IDF and word2vec are used. We use currently more and more popular BERT and its successors. We are integrating our developed solution into large-scale dialog system, which arises some new challenges. In my talk I'll try to describe to you our approach and demonstrate its results on open data. On it we are achieving 80% vs 40% for traditional approaches. Hopefully, you could get these ideas and apply them to your problem solution.",
        "speakers": [
            "ValentinMalykh"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "18:00",
        "timeEnd": "18:50",
        "lang": "En",
        "location": "13th floor",
        "title": "Why we should be scared of Shor's Algorithm right now",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Intermediate",
        "description": "Quantum computers are real and are starting to be used for some interesting applications. As well as many applications in finance, organic chemistry and complex dynamical systems there is an ugly elephant in the room. That elephant is Shor's algorithm.<br>Given a sufficiently powerful quantum computer, Shor's algorithm can factorise numbers in polynomial time. I have implemented it on a quantum simulator and it has been used on real quantum computers. When quantum computers are powerful enough nearly all the encryption techniques that we currently rely on will be useless.<br>The time is still far off when RSA will be useless but I will share some compelling reasons why we need to be taking action right now to avoid potential catastrophe in the not too distant future.",
        "speakers": [
            "JamesBirnie"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "18:00",
        "timeEnd": "18:50",
        "lang": "Ru",
        "location": "Room #1, 2nd floor",
        "title": "Logical fields in SQL, is there an antidote?",
        "talkTypeBadge": "Backend",
        "talkLevelBadge": "Intermediate",
        "description": "Often tables contain a large number of logical fields,<br>There is no way to index all of them, and the effectiveness of such indexing is low.<br>However, for working with arbitrary logical expressions in SQL<br>suitable multidimensional indexing mechanism, which will be discussed.",
        "speakers": [
            "BorisMuratshin"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "18:00",
        "timeEnd": "18:50",
        "lang": "En",
        "location": "Big room, 2nd floor",
        "title": "Devonomics",
        "talkTypeBadge": "Hype",
        "talkLevelBadge": "Intermediate",
        "description": "We love writing code, we love our paradigms, and we adore our little bubble of engineering existence. When we step into the chaos outside of our bubble, things quickly fall apart. The business makes illogical statements and decisions. Our inputs are either misunderstood or ignored.<br>Is it possible that we stepped out into a world with rules we do not understand? Can we learn them?<br>This talk covers the basic tenets of business and how they relate to our professional lives. We look into ways of communicating with business in an understandable way and backing it up with meaningful metrics.",
        "speakers": [
            "SrdjanVranac"
        ]
    },
    {
        "date": "2019-12-01",
        "timeStart": "19:00",
        "timeEnd": "19:20",
        "lang": "",
        "location": "13th floor",
        "title": "Closing",
        "talkTypeBadge": "",
        "talkLevelBadge": "",
        "description": "Closing",
        "speakers": [
            "TBA"
        ]
    }
]