[
	{
	  "date": "2019-11-29",
	  "timeStart": "14:30",
	  "timeEnd": "15:00",
	  "lang": "",
	  "location": "Halls",
	  "title": "Кофе-брейк",
	  "talkTypeBadge": "",
	  "talkLevelBadge": "",
	  "description": "Кофе-брейк",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-29",
	  "timeStart": "15:00",
	  "timeEnd": "17:00",
	  "lang": "En",
	  "location": "Room #2, 2nd floor",
	  "title": "Приложение на Flutter за пару часов",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "Beginner",
	  "description": "Создание приложения с нуля в течение нескольких часов - это уже не мечта. Избавьтесь от кошмара HTML / CSS / JS. Получите нативную производительность. Запускайте на любой платформе.",
	  "speakers": [
		"VsevolodHrechaniuk"
	  ]
	},
	{
	  "date": "2019-11-29",
	  "timeStart": "15:00",
	  "timeEnd": "16:00",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Mission Possible: Собрать PWA целиком из Web Components за 180 минут",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Соберём с вами рабочее кроссплатформенное прогрессивное веб-приложение (Progressive Web Apps, PWA), использующее современные аппаратные Web API, целиком из готовых веб-компонентов (Web Components), как из кубиков Lego, практически без единой строчки кода, и опубликуем его в Google Firebase.",
	  "speakers": [
		"AlexeyRodionov"
	  ]
	},
	{
	  "date": "2019-11-29",
	  "timeStart": "15:00",
	  "timeEnd": "16:00",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Дискуссионная зона Women Techmakers (WTM)",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Intermediate",
	  "description": "Дискуссионная зона Women Techmakers (WTM)",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-29",
	  "timeStart": "16:00",
	  "timeEnd": "17:00",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Дискуссионная зона Стартапы",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Intermediate",
	  "description": "Дискуссионная зона Стартапы",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-29",
	  "timeStart": "17:00",
	  "timeEnd": "19:00",
	  "lang": "Ru",
	  "location": "Room #2, 2nd floor",
	  "title": "Кроссплатформенная мобильная разработка в 2019: путь C++: воркшоп",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "Intermediate",
	  "description": "В C ++ существует достаточное количество фундаментальных нюансов из-за близости к bare-metal:<br>1. Неопределенное поведение<br>2. Use-After-Free<br>3. Повреждение памяти<br>4. Переполнение стека/кучи/глобального буфера<br>5. Use-After-Scope<br>6. Порядок инициализации<br>7. Утечки памяти<br>И это далеко не предел. Все эти нюансы могут очень больно и сильно выстрелить с самым непредсказуемым исходом для непосвященных в язык, из-за чего возникает необходимость каким-то образом отслеживать, диагностировать и решать такие проблемы.<br>На этом занятии мы попытаемся выявить все подобные случаи в реальном кроссплатформенном коде, попробуем написать наш собственный и отладить его должным образом.",
	  "speakers": [
		"AlexanderEfremenkov"
	  ]
	},
	{
	  "date": "2019-11-29",
	  "timeStart": "19:00",
	  "timeEnd": "21:00",
	  "lang": "",
	  "location": "",
	  "title": "Pre-party",
	  "talkTypeBadge": "",
	  "talkLevelBadge": "",
	  "description": "Pre-party",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "09:00",
	  "timeEnd": "10:30",
	  "lang": "",
	  "location": "Halls",
	  "title": "Регистрация",
	  "talkTypeBadge": "",
	  "talkLevelBadge": "",
	  "description": "Регистрация",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "09:00",
	  "timeEnd": "10:30",
	  "lang": "",
	  "location": "Halls",
	  "title": "Кофе-брейк",
	  "talkTypeBadge": "",
	  "talkLevelBadge": "",
	  "description": "Кофе-брейк",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "10:30",
	  "timeEnd": "10:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Открытие",
	  "talkTypeBadge": "",
	  "talkLevelBadge": "",
	  "description": "Открытие",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "11:00",
	  "timeEnd": "11:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Data-Driven Frontend Components и новая навигация в Jira",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "В любом крупном проекте рано или поздно встаёт вопрос создания своей библиотеки компонентов. А может быть использовать data-driven подход, и дать пользователю самому решить, чего он хочет от интерфейса?<br>В своем выступлении, построенном вокруг новой навигации для Jira, Will расскажет:<br>- О пользе data-driven подхода при разработке компонентов;<br>- Как проводить A/B тесты компонентов;<br>- Как повысить производительность;<br>- Как снизить размер пакетов.",
	  "speakers": [
		"WillMendes"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "11:00",
	  "timeEnd": "11:50",
	  "lang": "Ru",
	  "location": "Room #3, 3d floor",
	  "title": "Почему мы выбрали Flutter для “next big thing”",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "Intermediate",
	  "description": "В своем выступлении Геннадий расскажет, почему его команда выбрала Flutter для mission critical приложения, какие альтернативы были рассмотрены. Покажет какие показатели оценивали при разработке приложения, расскажет о проблемах, с которыми столкнулись.",
	  "speakers": [
		"GennadyEvstratov"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "11:00",
	  "timeEnd": "11:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Нейронная сеть, которая сомневается: байесовское глубокое обучение для распознавания текстов и речи",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Advanced",
	  "description": "Уточняется",
	  "speakers": [
		"IvanBondarenko"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "11:00",
	  "timeEnd": "11:50",
	  "lang": "En",
	  "location": "Room #3, 3d floor",
	  "title": "DevOps: история любви",
	  "talkTypeBadge": "DevOps",
	  "talkLevelBadge": "Intermediate",
	  "description": "Этот роман закрутился вокруг Docker, Kubernetes и Jenkins - технологии́, которые составляют огромную часть движения DevOps и заставляют трепетать сердца многих команд разработчиков.  Позвольте мне познакомить вас с этой троицей, и вы влюбитесь по уши.<br><br>В ходе презентации мы сделаем общий обзор таких концепций, как DevOps Культура, контейнеры, конвейеры сборки (pipeline), pod'ы (базовые строительные блоки Kubernetes), кластеры, CI/CD (непрерывная интеграция и поставка) и средства автоматизации.  С собой вы унесете фундаментальное понимание мира авто-магии!",
	  "speakers": [
		"ValarieRegas"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "12:00",
	  "timeEnd": "12:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Vue.js 3: Новое поколение front-end фреймворков",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Просто представьте себе новый мир самыми отзывчивыми и легковесными веб-приложениями, какие вы когда-либо видели. Фронтенд-разработчики не только пишут код для %названиеФреймворка%, но и знают, что они делают, и как это работает. И их много. Давайте обсудим, как новое поколение фронтенда воплощает часть этого волшебного мира в реальность.",
	  "speakers": [
		"IgorSheko"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "12:00",
	  "timeEnd": "12:50",
	  "lang": "Ru",
	  "location": "Room #3, 3d floor",
	  "title": "Прагматичный маппинг в Android-приложениях",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "Intermediate",
	  "description": "Мы поговорим про перенос данных из одной структуры в другую, посмотрим на существующие решения для автоматизации этого рутинного процесса. На основе достоинств и недостатков существующих решений помечтаем об идеальном инструменте и посмотрим на прототип нового инструмента. Я расскажу о том, как столкнулся с особенностями реализации Java API в андроиде и покажу разные методы изменения поведения программы: рефлексия, кодогенерация и изменение байткода.",
	  "speakers": [
		"AndrewMihin"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "12:00",
	  "timeEnd": "12:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Создание аккаунта в социальных медиа с помощью универсального набора инструментов для обучения машин",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Intermediate",
	  "description": "Социальные сети должны создаваться людьми, но мы изучаем возможности запуска аккаунта в социальных сетях с помощью универсального набора инструментов для машинного обучения и AI. Наши первоначальные эксперименты показывают, что мы можем создать много полезного контента, особенно для наших фанатов, которые заинтересованы в том, что мы делаем. Наша цель — иметь возможность управлять аккаунтами в социальных сетях. На данный момент мы сосредотачиваемся на создании контента в социальных сетях для нашей фан-базы, а не на создании каких-либо автоматизированных ботов.",
	  "speakers": [
		"KirillMalev"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "12:00",
	  "timeEnd": "12:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Cloud Native, Service-Meshed Java Enterprise With Istio",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "За плечами Sebastian 8 лет работы в Java энтерпрайзе, группы стандартизации Java EE, работа над JSR, книга “Architecting Modern Java EE Applications”...<br>В своем докладе Sebastian расскажет:<br>- как реализовать service-meshed приложения, используя Jakarta EE 8, MicroProfile и Istio<br>- как развернуть приложение в Kubernetes<br>- как решить проблему мониторинга, трэйсинга, отказоустойчивости (что дает платформа, а что придется делать самому)<br>И все это в режиме live-coding!",
	  "speakers": [
		"SebastianDaschner"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "13:00",
	  "timeEnd": "13:50",
	  "lang": "",
	  "location": "Canteen",
	  "title": "Ланч",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "",
	  "description": "Ланч",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "13:00",
	  "timeEnd": "13:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Ставки, деньги, ALS: ранжирование в рекламном продукте Яндекс.Дзен",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Intermediate",
	  "description": "Яндекс.Дзен - сервис персональных рекомендаций, подбирающий пользователям интересный и уникальный контент по их интересам.<br>На основании рекомендаций Дзена мы создаем рекламу нового образца: как интересную пользователям, так и полезную рекламодателям.<br>В своём докладе я расскажу о том, как мы запускали нашу рекламную площадку с точки зрения ML:<br>- Про то, как устроен пайплайн рекомендаций рекламы;<br>- Про сложности, с которыми мы столкнулись при запуске;<br>- Про простые и практичные ML-решения, которые помогли нам вырастить дочитывания в полтора раза;<br>- Про то, насколько важен правильный таргет в обучении;<br>- И про новые вызовы и интересные задачи, которые нам предстоит решить.<br>Хотите учить алгоритмы зарабатывать с помощью ML? Приходите, мы расскажем, как получается у нас.",
	  "speakers": [
		"BorisSharchilev"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "13:00",
	  "timeEnd": "13:50",
	  "lang": "Ru",
	  "location": "Room #3, 3d floor",
	  "title": "Кроссплатформенная мобильная разработка в 2019: путь C++",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "Intermediate",
	  "description": "Сегодня любой разработчик без труда может найти инструмент кроссплатформенной мобильной разработки: Flutter, Kotlin Native, React Native, Xamarin, Cordova. Но есть такие технологии, которым уделяется меньше внимания, одна из которых C++.<br>В своем докладе Александр сравнит разные подходы к разработке, расскажет как живут разработчики c++ на мобильной платформе, с какими проблемами сталкиваются и как их решают.<br>А в первый день конференции Александр проведет воркшоп по этой теме.",
	  "speakers": [
		"AlexanderEfremenkov"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "13:00",
	  "timeEnd": "13:50",
	  "lang": "",
	  "location": "Canteen",
	  "title": "Ланч",
	  "talkTypeBadge": "DevOps",
	  "talkLevelBadge": "",
	  "description": "Ланч",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "14:00",
	  "timeEnd": "14:50",
	  "lang": "Ru",
	  "location": "Big room, 2nd floor",
	  "title": "PWA/TWA без купюр",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "На конференциях о технологиях и презентациях продуктов обычно не принято говорить о недостатках и проблемах.<br>Я же расскажу о проблемах, с которыми мы столкнулись в нашем стартапе «ГдеЗерно» (“Uber” для зерновозов) при разработке, запуске и эксплуатации в продакшене на протяжении более 2 лет первого в России коммерчески успешного прогрессивного веб-приложения (Progressive Web App, PWA) и Trusted Web Activity (TWA), собранного целиком из веб-компонентов (Web Components) с использованием Google Polymer (а позднее и Google LitElement) на front-end и Google Firebase (а позднее и Prisma GraphQL) на back-end, как мы решали эти проблемы, и как в итоге повлияли на Web-платформу и экосистему GraphQL.",
	  "speakers": [
		"AlexeyRodionov"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "14:00",
	  "timeEnd": "14:50",
	  "lang": "",
	  "location": "Canteen",
	  "title": "Ланч",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "",
	  "description": "Ланч",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "14:00",
	  "timeEnd": "14:50",
	  "lang": "",
	  "location": "Canteen",
	  "title": "Ланч",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "",
	  "description": "Ланч",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "14:00",
	  "timeEnd": "14:50",
	  "lang": "En",
	  "location": "Room #1, 2nd floor",
	  "title": "Платформа мертва, да здравствует платформа!",
	  "talkTypeBadge": "DevOps",
	  "talkLevelBadge": "Intermediate",
	  "description": "Долой старое, да здравствует новое. На замену функционирующей платформы приходит блестящая автоматическая контейнерная упаковка...<br>Когда компании развиваются, их технологические стеки также нуждаются в развитии. Но иногда вы понимаете, что улучшить нужно все, и вам проще отказаться от всего этого.<br>Я хочу показать вам миграцию с нулевым временем простоя из устаревшего стека, основанного на Jenkins, Ansible, Icinga, HAproxy, nginx, uwsgi, pypi и Tomcat, на новый, основанный на Travis, Docker, CloudFormation и ECS / Fargate, с различными техническими долгами, решаемыми на этом пути.<br>Представлю общий обзор технологий, склоняющихся к serverless идеалогиии, вообще без самоуправляемых ресурсов (классических серверов). Обсуждение будет сосредоточено на предложениях AWS, но применимо к большинству популярных публичных облаков.<br>По сути это Heroku для богатых, обладающий всей гибкостью, которая может вам понадобиться, избегая при этом таких страшных технологий, как Kubernetes, которым никто не хочет по-настоящему научиться правильно управлять.",
	  "speakers": [
		"LukaKladaric"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "15:00",
	  "timeEnd": "15:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Классы могут и не понадобиться",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Более трех лет прошло с введения классов в стандарт ECMAScript, а споры вокруг них до сих пор не утихают!<br>В своем выступлении Ramón рассмотрит проблемы использования классов. Предложит альтернативные шаблоны, основанные только на функциях - более простые, мощные, идеоматичные и безопасные.<br>",
	  "speakers": [
		"RamónGuijarro"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "15:00",
	  "timeEnd": "15:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Как стать Data Scientist'ом: гид для разработчика, ученого, студента",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Beginner",
	  "description": "В наше время, со всех сторон мы слышим о машинном обучении (и ИИ). Многие уже работают дата саентистами, другие думают о том, как ими стать. Попробую ответить на вопросы: А стоит ли? О чем это действительно? Как сделать переход? На примерах нашей 3-летней истории в ЦФТ.",
	  "speakers": [
		"IvanKomarov"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "15:00",
	  "timeEnd": "15:50",
	  "lang": "",
	  "location": "Room #3, 3d floor",
	  "title": "TBA",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "",
	  "description": "TBA",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "15:00",
	  "timeEnd": "15:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Интеграционные тесты на Go",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "В нашем мире распределенных систем есть множество связей между компонентами. Ошибка хотя бы в одном взаимодействии может привести к деградации системы и потере прибыли компании. Покрытие интеграционными тестами позволяет снизить риск, и в этом контексте ценность интеграционного тестирования увеличивается. Но оно не получает должного внимания (как, например, unit-тестирование, которое у Go-программистов в генах). Мы в Badoo задались целью написать интеграционные тесты на Go, и у нас это получилось.<br>В докладе рассмотрим, что такое интеграционное тестирование, как реализовать для него фреймворк на Go, какие сложности перед нами стояли, и каких результатов удалось достичь. Вы увидите, что писать интеграционные тесты на Go реально и не так больно.<br>План<br>1. Зачем нужны интеграционные тесты<br>2. Как поднять инфраструктуру<br>3. Как подготовить сервис перед стартом<br>4. Параллельный старт сервисов<br>5. Ожидание готовности сервиса<br>6. Работа с инфраструктурой в тесте<br>7. Как отлаживать тесты<br>8. Как выглядит тестовый фреймворк",
	  "speakers": [
		"KseniaYakil"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "16:00",
	  "timeEnd": "16:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "To be announced",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Intermediate",
	  "description": "Уточняется",
	  "speakers": [
		"JaniEväkallio"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "16:00",
	  "timeEnd": "16:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Полное руководство по сбоям программного обеспечения на ARM64",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Внедрение второй архитектуры ЦП в x86-инфраструктуру может быть сложной задачей: вам нужно не только найти подходящее оборудование и научиться правильно его подготавливать, но портировать весь программный стек, который, вероятно, был разработан и улучшался в течение многих лет, когда о второй архитектуре никто и не думал.<br>И даже не смотря на то, что все компоненты вашего стека написаны на языке кроссплатформенной разработки (например, Go или Java), есть много причин, по которым они могут выйти из строя на после переноса на новую архитектуру.<br>В этой презентации описываются проблемы, с которыми мы столкнулись при портировании нашего программного обеспечения на ARM64, и даются советы для разработчиков о том, как их избежать при написании нового кода.",
	  "speakers": [
		"IgnatKorchagin"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "16:00",
	  "timeEnd": "16:50",
	  "lang": "En",
	  "location": "13th floor",
	  "title": "Neural Architecture Search для самых маленьких",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Advanced",
	  "description": "Ни для кого не секрет, что нейронные сети - это оптимальный на сегодняшний день способ решения задач, связанных с обработкой изображений, звука и текста. Однако, качество работы нейронной сети может сильно зависеть от того, в какой последовательности мы применяем те или иные операции. Как же быть? Как автоматизировать процедуру построения архитектуры нейронной сети? Мой доклад будет именно об этом. Сначала будут разобраны основные подходы, которые предлагают ведущие специалисты в этой области, а потом расскажу о тех проблемах, с которыми мы столкнулись при непосредственной разработке подобного алгоритма у себя.",
	  "speakers": [
		"AlexanderGoncharenko"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "16:00",
	  "timeEnd": "16:50",
	  "lang": "Ru",
	  "location": "Room #3, 3d floor",
	  "title": "Внутреннее устройство WebRTC",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "Внутреннее устройство WebRTC<br> - разбор компонент которые WebRTC<br> - использование WebRTC на сервере<br> - алгоритмы bandiwdth estimation и сетевые модели",
	  "speakers": [
		"IlyaShcherbak"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "17:00",
	  "timeEnd": "17:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Тестирование Web Accessibility",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Advanced",
	  "description": "Хороший UX (User eXperience) дизайн не достаточно хорош, если он не подходит для всех, включая людей с ограниченными возможностями. Однако, правильные пути достижения доступности не должны быть слишком сложны!<br>В своем выступлении Adrián Bolonio познакомит вас с инструментами, библиотеками и методами для увеличения покрытия вашего кода тестами a11y.",
	  "speakers": [
		"AdrianBolonio"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "17:00",
	  "timeEnd": "17:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Как построить ловушку для хиппи",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Intermediate",
	  "description": "В своем докладе Катерина расскажет о работе Ko-Tyat-Ki Kollektive над инсталляцией Ear of the universe для фестиваля European Burning Man в 2019 году - пространственного музыкального инструмента, позволяющего зрителям сыграть симфонию на канате.<br>Вы пройдете весь творческий путь от идеи (кровь, пот и слезы) к технической реализации.<br>В конце выступления Катерина покажет, как внести вклад в развитие проекта, использую всего несколько строк Javascript!",
	  "speakers": [
		"EkaterinaLoschinina"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "17:00",
	  "timeEnd": "17:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Автоматические методы построения таксономий по текстам",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Intermediate",
	  "description": "Для повышения качества автоматической обработки текстов часто нужно использовать знания: лексические (синонимы, антонимы и др.), знания о мире или о конкретной предметной области. <br>Для представления таких знаний вручную создаются специализированные компьютерные ресурсы: таксономии,<br>онтологии, тезаурусы, при этом часто возникает вопрос, насколько можно автоматизировать извлечение знаний из текстовых коллекций.<br>В докладе будут рассмотрены известные лексико-семантические ресурсы для автоматической обработки текстов, а также будут описаны различные тестирования и их результаты по автоматическому извлечению родо-видовых (таксономических) отношений из текстовых коллекций.",
	  "speakers": [
		"NatalyaLukashevich"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "17:00",
	  "timeEnd": "17:50",
	  "lang": "Ru",
	  "location": "Room #3, 3d floor",
	  "title": "Дневники неудач Patroni или Как уронить PostgreSQL",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Advanced",
	  "description": "Основная цель Patroni - это обеспечение High Availability для PostgreSQL. Но Patroni - это лишь template, а не готовый инструмент (что, в общем, и сказано в документации).<br>На первый взгляд, настроив Patroni в тестовой лабе, можно увидеть, какой это прекрасный инструмент и как он легко обрабатывает наши попытки развалить кластер. Однако на практике в производственной среде, не всегда всё происходит так красиво и элегантно, как в тестовой лабе.<br>В этом докладе я попытаюсь собрать и рассказать в деталях о тех crash-кейсах, с которыми мы столкнулись при эксплуатации PostgreSQL и Patroni у наших клиентов. В ходе доклада вы узнаете о том, с какими проблемами мы столкнулись, как мы с ними справлялись и какие уроки извлекли. Также узнаете, как правильно и как неправильно конфигурировать Patroni (и, возможно, PostgreSQL). И, конечно, получите представление о том, как оперативно выявлять возникающие проблемы и оперативно их устранять.",
	  "speakers": [
		"LesovskyAlexey"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "18:00",
	  "timeEnd": "18:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Другая сторона безопастности веб-приложений",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Защита вашего backend и базы данных на высоте, а что на счёт пользователей? Как мы можем защитить их данные, браузеры и компьютеры?<br>Мы уделяем особое внимание внутренней безопасности, передовым техникам хранения паролей, их восстановлению, шифрованию и т.д. Однако чтобы использовать их на каждом конкретном веб-сайте нужно приложить немало усилий.<br>И все равно пользователи этих сайтов подвергаются риску каждый день, когда выходят на них через незащищенные сети Wi-Fi в отелях и кафе.<br>В нашей беседе мы рассмотрим не только обычных подозреваемых - HTTPS и сертификаты, но и некоторые новые технологии HTTP Strict Transport Security (HSTS) и Content Security Policy (CSP).",
	  "speakers": [
		"LukaKladaric"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "18:00",
	  "timeEnd": "18:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "От SentEval до SentEvalRu: семантические вектора предложений для задач анализа русских текстов и способ автоматической оценки их качества",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Intermediate",
	  "description": "Эмбеддинги предложений используются везде, где решаются или используются задачи компьютерной лингвистики, например:<br>- классификация намерений пользователей в чат-ботах (intent classifier);<br>- использование в вопросно-ответных системах для поиска ответа на вопрос пользователя наиболее близкий по смыслу;<br>- встраивание в парсеры веб-контента для анализа тональности текста (sentiment analyses);<br>- дачи машинного перевода;<br>- задачи кластеризации документов.<br>В своём докладе расскажу о популярных видах эмбеддингов и о том, какие языковые модели есть для русского языка. Также обсудим задачи, на которых можно оценивать их качество, и посмотрим, какие векторные представления работают лучше на каждой из них.",
	  "speakers": [
		"AnnaMosolova"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "18:00",
	  "timeEnd": "18:50",
	  "lang": "En",
	  "location": "13th floor",
	  "title": "Как правильно продать себя ради фана и профита",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Beginner",
	  "description": "Казалось бы, зачем разработчику персональный бренд? Сидит, никого не трогает, примусы починяет (т.е. код пишет). Чем меньше его знают, тем меньше его трогают, ведь правда?<br>Но тут вот какое дело: согласно исследованиям, лучший способ повысить зарплату, это сменить работу. А при приёме на работу публичность и персональный бренд — половина дела! А уж когда дело доходит до найма, то хороший персональный бренд менеджмент даст 100 очков вперед любым печенькам с пинг-понгом.<br>В этом доклад Барух расскажет вам как так получилось, что вы знаете, кто такой Барух, как это знание конвертируется в плюшки для Баруха, и как вы можете повторить его успех.",
	  "speakers": [
		"BaruchSadogursky"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "18:00",
	  "timeEnd": "18:50",
	  "lang": "Ru",
	  "location": "Room #3, 3d floor",
	  "title": "В поисках своего API. Переход с REST на GraphQL в крупном проекте.",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": " Архитектура REST – почти синоним API. Но сделать хорошо снаружи и внутри, быстро и особенно с первой версии, получается не всегда. Мы запустили новый проект и у нас не получилось. <br>Тогда мы задумались, стоит ли тратить вторую попытку на рефакторинг или лучше копнуть глубже и REST не до конца подходит нам как подход.<br>Оказалось, что концептуально не все участники команды принимали его особенности и многие вещи воспринимались по-разному. Отчасти поэтому возникло дублирование кода и выросла сложность в поддержке.<br>Тогда мы попробовали внедрить GraphQL, который по описанию больше подходил нашей команде.<br>Как мы к этому шли, что из этого получилось и насколько сложно два круга из документации дорисовать в сову на рабочем проекте я и хочу рассказать.<br>Из доклада вы узнаете, как крупная компания может дать шанс абсолютно новой для себя технологии. Насколько сложно это продавать и как решали вопрос поддержки принятого общего формата api для всей экосистемы.<br>Расскажу, как следовало бы избегать проблемы роста сложности поддержки API изначально.",
	  "speakers": [
		"DenisYuriev"
	  ]
	},
	{
	  "date": "2019-11-30",
	  "timeStart": "19:20",
	  "timeEnd": "21:30",
	  "lang": "",
	  "location": "Canteen",
	  "title": "After-party",
	  "talkTypeBadge": "",
	  "talkLevelBadge": "",
	  "description": "After-party",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "10:00",
	  "timeEnd": "10:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Cloud Composer: упрощение рабочих процессов с мощным оркестратором в GCP",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Мы углубимся под капот Cloud Composer, чтобы раскрыть его огромную силу, глядя на то, что он может сделать:<br>- внутреннее устройство: celery, redis, GKE, GCS, SQL;<br>- термины: DAG, operator, workflow, hook, xcom и многое другое;<br>- настройка: настраиваемые операторы, настраиваемые датчики, настраиваемое развёртывание;<br>- преимущества GCP: частные IP-адреса, VPC-native, Kubernetes Pod Operator, Stackdriver;<br>- варианты использования: CI/CD, инфраструктура, ETL, ML workflow и сложных конвейеров данных;<br>- интеграция: terraform, slack и т.д.",
	  "speakers": [
		"VsevolodHrechaniuk"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "10:00",
	  "timeEnd": "10:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Роли и позиции в Data Science. С чего начать?",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Beginner",
	  "description": "У вас есть опыт разработки и вы интересуетесь DS. Может быть, даже получилось пройти пару курсов и поучаствовать в хакатонах. Что делать дальше? В публикуемых вакансиях в DS есть много разных ролей. Что ожидается от каждой из них, какие требования предъявляются - и, самое главное, как готовиться к собеседованиям?<br>Расскажу про то, чем отличаются Data Scientist, Data Analyst и ML Engineer, про то, как организовано взаимодействие их друг с другом в рамках компаний. И, конечно, затрону, какие навыки требуются в этих должностях и как их лучше всего прокачать.",
	  "speakers": [
		"VladGrozin"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "10:00",
	  "timeEnd": "10:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Не верьте слухам о монолите",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "Я хочу рассказать, как мы пришли к тому, что у нас оказалось слишком много микросервисов, как мы решили избавиться от большинства этих микросервисов, что из этого получилось и какие мы сделали выводы.",
	  "speakers": [
		"IgorDultsev"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "10:00",
	  "timeEnd": "10:50",
	  "lang": "Ru",
	  "location": "Room #3, 3d floor",
	  "title": "Accessibility в банковском приложении: как мы делаем Рокетбанк удобным для всех",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "Intermediate",
	  "description": "Уточняется",
	  "speakers": [
		"NarekChanglian"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "11:00",
	  "timeEnd": "11:50",
	  "lang": "En",
	  "location": "Room #3, 3d floor",
	  "title": "Как не облажаться при разработке мобильного приложения",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "Intermediate",
	  "description": "С каждым днём количество мобильных приложений все увеличивается. А на каком месте стоит вопрос безопасности - на первом, десятом или не стоит вообще?<br>В своем докладе Yogesh расскажет об основных аспектах безопасности приложений:<br>- Хранение персональных данных;<br>- Защита приложений от реверс инжиниринга;<br>- Уязвимости платформы Android;<br>- Проблемы изоляции.<br>Этот доклад даст краткое представление об 10 основных уязвимостях мобильного приложения по версии OWASP (Open Web Application Security Project) и о том, как не использовать их в вашем следующем проекте на миллиард долларов.",
	  "speakers": [
		"YogeshOjha"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "11:00",
	  "timeEnd": "11:50",
	  "lang": "En",
	  "location": "Room #1, 2nd floor",
	  "title": "Паттерны и антипаттерны непрерывных обновлений в практике DevOps",
	  "talkTypeBadge": "DevOps",
	  "talkLevelBadge": "Beginner",
	  "description": "Итак, ты решил обновить софт у своих пользователей. Может быть, это 100500 микросервисов в их кластере Kubernetes, может быть, это очередной редактор на JavaScript у них на ноутбуке, может быть, это приложение для дипфейков в их смартфоне, а может быть, ты даже не побоялся обновить их автомобиль! Что уже может пойти не так, правда?!<br>В этом докладе мы проанализируем реальные фейлы, которые ежедневно и повсеместно происходят при обновлении софта. Мы посмотрим, как всевозможные DevOps-паттерны ложатся на эти сценарии и как правильное их применение смогло бы, возможно, спасти всех этих людей. И нет, хорошенько проверить всё ручками перед отправкой и попросить у пользователя еще раз хорошенько проверить всё ручками при приёмке не является одним из рекомендованых паттернов, несмотря на то, что так делает половина индустрии!<br>Приходите послушать полезные кошмарики про непрерывное обновление, и вы получите шанс познакомиться со множеством очевидных (и не таких уж и очевидных!) проверенных идей и практик, которые вы сможете начать применять сразу после доклада, и, может быть, ваши пользователи будут ненавидеть вас немножко меньше!",
	  "speakers": [
		"BaruchSadogursky"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "11:00",
	  "timeEnd": "11:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Больше пользы от Дизайн-токенов",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Дизайн-токены (Design tokens) – это таинственное средство от самых сильных болей при работе с дизайн-системами. Я покажу основные варианты использования дизайн-токенов и продемонстрирую синхронизацию дизайна с кодом в реальном времени. Также я поделюсь всеми необходимыми ресурсами, чтобы вы могли начать использовать эту концепцию в своей работе.",
	  "speakers": [
		"MikołajDobrucki"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "11:00",
	  "timeEnd": "11:50",
	  "lang": "En",
	  "location": "13th floor",
	  "title": "SEO: Антиреклама data science",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Intermediate",
	  "description": "SEO (поисковая оптимизация, Search Engine Optimization) - комплекс мер по внутренней и внешней оптимизации для поднятия позиций сайта в результатах выдачи поисковых систем по определённым запросам пользователей, с целью увеличения сетевого трафика (для информационных ресурсов) и потенциальных клиентов (для коммерческих ресурсов) и последующей монетизации (получение дохода) этого трафика. (Wikipedia)<br> Повестка дня:<br> - SEO<br> - SEO эксперименты<br> - Framework: Causal Impact (a Google model)<br> - Пример A/B теста",
	  "speakers": [
		"PabloPerezDeAngelis"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "12:00",
	  "timeEnd": "12:50",
	  "lang": "Ru",
	  "location": "Room #3, 3d floor",
	  "title": "Разоблачаем магию DiffUtil",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "Intermediate",
	  "description": "Каждый Android разработчик использовал RecyclerView для отображения списков и каждый сталкивался с проблемой обновления данных в списке, пока в 2016 году не появился магический класс DiffUtil. Я на пальцах объясню как на самом деле он работает и постараюсь рассеять его магию.<br>Помимо материала, который вы могли уже прочитать в моей статье на хабре, на митапе я расскажу что происходит после поиска изменений алгоритмом Майерса: как ищутся перемещения, как расставляются флаги изменений и как именно применяются изменения к адаптеру.",
	  "speakers": [
		"PetrKozlov"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "12:00",
	  "timeEnd": "12:50",
	  "lang": "Ru",
	  "location": "Big room, 2nd floor",
	  "title": "Serverless для frontend-разработчиков, или Можно ли обойтись без классического бэкенда",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Из доклада frontend-разработчики узнают о том, как с помощью serverless-подхода можно реализовать хранение данных, авторизацию и исполнение кода в облаке без настройки и поддержки серверов. Рассматриваются функции как сервис (FaaS) на примере AWS Lambda с GraphQL API для синхронизации данных. Такой подход может использоваться как для быстрого прототипирования, так и в реальных сценариях, когда требуется неограниченное масштабирование вашего решения. На практических примерах мы рассмотрим существующие serverless-фреймворки и архитектуру serverless-приложений.",
	  "speakers": [
		"SergeyPugachev"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "12:00",
	  "timeEnd": "12:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Фантазии девелопера или Ночной кошмар DBA",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "Я и мои коллеги из Data Egret - PostgreSQL консалтеры и жизнь дала нам уникальную возможность смотреть и участвовать в процессе развития баз данных в самых разных компаниях - от маленьких, до больших. Но независимо от размера, при эксплуатации СУБД все они периодически наступают на разные грабли. В этом докладе я постараюсь разобрать разные ситуации, которые иногда возникают спонтанно, а иногда команды разработки видят их как решение задачи, но при этом dba team видит в них источник потенциальных проблем.<br>В докладе я рассмотрю<br>- проблемы с дефолтными конфигурациями, которые встречаются практически везде<br>- антипаттерны связанные с проектированием схем данных<br>- проблема длинных транзакции которые часто становятся сюрпризом<br>- мониторинг и когда его отсутствие тоже доставляет массу материала для статей на хабре<br>- еще будет про самописные системы очередей, HTAP workload, немного подзабытую бигдату, микросервисы, docker/kubernetes.<br>По ходу доклада слушатели узнают про некоторые best и worst practices при работе с СУБД и уже смотря на свои базы смогут заранее спрогнозировать возникновение неприятных ситуаций и заранее предпринять меры.<br>Доклад будет полезен широкому кругу технических специалистов вовлеченных в разработку ПО и обслуживание баз данных.",
	  "speakers": [
		"LesovskyAlexey"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "12:00",
	  "timeEnd": "12:50",
	  "lang": "",
	  "location": "13th floor",
	  "title": "TBA",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "",
	  "description": "TBA",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "13:00",
	  "timeEnd": "13:50",
	  "lang": "",
	  "location": "Room #3, 3d floor",
	  "title": "Ланч",
	  "talkTypeBadge": "Mobile",
	  "talkLevelBadge": "",
	  "description": "Ланч",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "13:00",
	  "timeEnd": "13:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Golang на фронте",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Несомненно, внутри каждого разработчика живет художник. А что если он хочет творить на Go?<br>В своем докладе Aarushi расскажет вам, как создавать интерфейсы исключительно на Go, используя WebAssembly и Vugu (UI библиотека на Go, вдохновленная успехом Vue и React), и продемонстрирует один из личных проектов, расскажет о тестировании и CI таких проектов - все, что нужно, чтобы написать свой следующий UI на Go!",
	  "speakers": [
		"AarushiKansal"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "13:00",
	  "timeEnd": "13:50",
	  "lang": "",
	  "location": "Room #1, 2nd floor",
	  "title": "Ланч",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "",
	  "description": "Ланч",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "13:00",
	  "timeEnd": "13:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Что в коде твоем? Исследуем код пользователей с помощью Big Data, Spark и Zeppelin.",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Beginner",
	  "description": "В этом докладе мы возьмем Spark, Zeppelin, и Big Data Tools от Jetbrains и исследуем исходный код Intellij IDEA Community. С помощью Big Data, узнаем интересные закономерности в написание кода, и найдем статистические отличия кода на Kotlin от кода на Java.",
	  "speakers": [
		"NikitaAshikhmin"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "14:00",
	  "timeEnd": "14:50",
	  "lang": "En",
	  "location": "Room #3, 3d floor",
	  "title": "Фриланс без дураков",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Intermediate",
	  "description": "Итак, вы стали фрилансером - теперь вы работаете на себя и сами выбираете, какая работа вам по душе. Что делать с этой вновь обретенной свободой?<br>В своем докладе Tom расскажет о профессиональном росте, управлении двумя параллельными карьерами, преимуществах и подводных камнях - короче, расскажет все, что вы хотели знать о фрилансе, но боялись спросить.",
	  "speakers": [
		"TomKozacinski"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "14:00",
	  "timeEnd": "14:50",
	  "lang": "",
	  "location": "Big room, 2nd floor",
	  "title": "Ланч",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "",
	  "description": "Ланч",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "14:00",
	  "timeEnd": "14:50",
	  "lang": "En",
	  "location": "Room #1, 2nd floor",
	  "title": "Где мой кэш? Архитектурные шаблоны кэширующих микросервисов с примерами",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "Все знают, что нам нужен кэш, но где именно его разместить? Внутри приложения или отдельным слоем перед ним? В контейнере или за его пределами? В век облаков и микросервисов эти вопросы становятся ещё сложнее. В этом докладе я представлю вам различные архитектурные шаблоны распределенного кэширования: Embedded, Client-Server, (Kubernetes) Sidecar и Proxy Caching.",
	  "speakers": [
		"RafałLeszko"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "14:00",
	  "timeEnd": "14:50",
	  "lang": "",
	  "location": "13th floor",
	  "title": "Ланч",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "",
	  "description": "Ланч",
	  "speakers": [
		"TBA"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "15:00",
	  "timeEnd": "15:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Умная железная дорога, GCP и IoT",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Intermediate",
	  "description": "Расскажу про проблемы в мире интернета вещей и покажу, как быстро собрать IoT прототип с большими потенциалом. Во время доклада  соберу умную железную дорогу и покажу как можно через gcp ею управлять!",
	  "speakers": [
		"VladimirDaron"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "15:00",
	  "timeEnd": "15:50",
	  "lang": "Ru",
	  "location": "Big room, 2nd floor",
	  "title": "Видео в вебе от Flash до MSE или как написать свой видеоплеер",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Потоковое видео в вебе прошло долгий путь — от Flash до Media Source Extensions. Поговорим, о том какие API и форматы используют современные видео-хостинги и том, что вам нужно будет знать, если вы захотите сделать свой собственный онлайн-кинотеатр.<br>Особое внимание уделю современным стриминговым видео-форматам, а также браузерным API, необходимым для их поддержки.",
	  "speakers": [
		"AlexeyGusev"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "15:00",
	  "timeEnd": "15:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Что делает БД уникальной или Сильные стороны Tarantool",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "Паттерны и антипаттерны существуют не только в программировании, но и в работе с данными и базами данных. Если ваше приложение интенсивно использует данные, то ошибка модели может привести к огромным проблемами в эксплуатации и затруднить дальнейшую разработку.<br>Многие программисты проектнуют свои первый модели данных в реляционных базах, которые обеспечивают централизованное представление данных. Предположения и парадигмы, пришедшие с RDBMS, переносятся ими из проекта в проект на протяжении всей карьеры и лишь немногие ищут лучший инструмент для новой задачи.<br>В этом выступлении я представлю несколько шаблонов моделирования данных, демонстрирующих области, в которых Tarantool, многофункциональная и быстрая платформа данных, обладает уникальными преимуществами: обработкой очень изменчивых, высокосвязанных транзакционных данных.",
	  "speakers": [
		"KonstantinOsipov"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "15:00",
	  "timeEnd": "15:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "SpaCy-RU: быстрые нейросети для анализа текстов",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Intermediate",
	  "description": "Задачи обработки текста бывают очень разными, но наиболее частые из них -- это разбиение текста на слова и предложения, синтаксический разбор и выделение имён и названий людей и организаций.<br>Мы поговорим о библиотеке spacy -- популярном нейросетевом многоязычном инструменте для решения этих задач, и о её русской версии.<br>Мы разберём как внутреннее устройство, так и некоторые практические аспекты использования библиотеки для решения ваших задач.",
	  "speakers": [
		"YuriBaburov"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "16:00",
	  "timeEnd": "16:50",
	  "lang": "En",
	  "location": "Room #1, 2nd floor",
	  "title": "DevOps для машинного обучения",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Advanced",
	  "description": "Создание модели машинного обучения - это только отправная точка. Прежде чем запустить её в производство, вам необходимо решить множество реальных проблем, таких как создание pipeline для непрерывного обучения, автоматическая проверка модели, масштабируемая инфраструктура обслуживания и поддержка нескольких сред во все более распространенных multi-cloud установках. На этом занятии мы изучим концепцию ML Ops (DevOps for ML) и то, как использовать TFX, Kubeflow Pipelines для построения и поддержки систем машинного обучения высокого качества.<br>Также будет показано создание модели, развертывание и перемещение модели в нескольких средах.<br>У меня сложилось впечатление, что мир исследований в области глубокого обучения начинает выходить на передовой уровень. Поэтому процветает применение глубокого обучения для решения реальных проблем.<br>-François Chollet",
	  "speakers": [
		"VasudevMaduri"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "16:00",
	  "timeEnd": "16:50",
	  "lang": "Ru",
	  "location": "Big room, 2nd floor",
	  "title": "Священный грааль: запуск React в Java",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Много слухов ходит, про загадочный и суровый сайт в компании Одноклассники. Многие слышали, что там все делается на Java. Даже фронтенд.<br>А что же на самом деле там происходит?<br>В этом докладе будет история того, как это получилось, какие были проблемы, и как был найден путь решения с использованием новой виртуальной машины GraalVM и React.<br>Я расскажу о том:<br>- Почему мы не взяли NodeJS, Kotlin, Nashorn и другие решения<br>- Почему был выбран GraalVM<br>- Как работает JS в GraalVM и какие это дает преимущества<br>- Как собрать и запустить React в такой конфигурации<br>- Какие появляются задачи и способы их решения<br>- Как можно начать постепенную миграцию, огромного проекта<br>",
	  "speakers": [
		"OlegKorovin"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "16:00",
	  "timeEnd": "16:50",
	  "lang": "En",
	  "location": "Room #1, 2nd floor",
	  "title": "Distributed Domain Destruction",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "Последние пару лет я собирал, поддерживал и боролся с проектами, в которых используются распределенные вычисления, параллельная обработка данных, брокеры сообщений, очереди и воркеры. Это один из тех докладов «из первых рук», в котором я расскажу вам о том, что может произойти с вашим приложением по мере его усложнения. Также я расскажу о колебании дискового пространства, важности логирования, проблемах NoSQL, реструктуризации порядка выполнения в коде для повышения производительности, недальновидных, хотя и логичных архитектурных решениях, которые дорого обойдутся вам в долгосрочной перспективе.",
	  "speakers": [
		"SrdjanVranac"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "16:00",
	  "timeEnd": "16:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Обучения с первого раза для обработки и понимания естественного языка",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Intermediate",
	  "description": "В Huawei мы решаем реальные задачи. Наша команда проводит большую часть своего времени в работе над диалоговыми системами.<br>Одна из проблем, которую мы решаем, заключается в том, чтобы выбрать правильный навык в каждой ситуации. Задача становится ещё интереснее, если у нас вообще нет обучающего набора данных. Традиционно для таких случаев используются TF-IDF и word2vec. На данный момент мы используем все более популярный BERT и его преемников. В своем выступлении я постараюсь описать наш подход и продемонстрировать его результаты на открытых данных. Надеюсь, это позволит вам понять, чего достигли мы, и применить эти идеи к решению вашей проблемы.",
	  "speakers": [
		"ValentinMalykh"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "17:00",
	  "timeEnd": "17:50",
	  "lang": "En",
	  "location": "Room #3, 3d floor",
	  "title": "Практикуем непрерывное развертывание: создаем свой интернет вещей",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Advanced",
	  "description": "Современный тестировщик  должен обладать аналитическим мышлением, иметь базовые навыки разработки, а еще неплохо иметь опыт работы в agile-команде. Так с какими задачами сталкиваются ежедневно, работая в сфере IoT?<br>За последние несколько лет Dawid уже трижды проходил процесс трансформации команды от «QA Team» к «Dev / TestOps» в IoT-компаниях.<br>Dawid расскажет, как построить централизованную автоматизированную среду тестирования для IoT проектов, используя Jenkins, Python, подход BDD и немного знаний hardware.",
	  "speakers": [
		"DawidPacia"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "17:00",
	  "timeEnd": "17:50",
	  "lang": "En",
	  "location": "Big room, 2nd floor",
	  "title": "Борьба за свободу копи-паста сложных паролей ",
	  "talkTypeBadge": "Web",
	  "talkLevelBadge": "Intermediate",
	  "description": "Никто не знает, откуда она взялась, но она распространяется как болезнь: блокировка функциональности вставки в онлайн-формах паролей. Нет объяснений, нет исследований, лишь типичное «это для вашей безопасности…». И все это в эпоху, когда угроза слабых и переиспользуемых паролей почти побеждена, благодаря менеджерам паролей.<br>Некоторые пытаются дать отпор: например, Firefox позволяет пользователям убрать блок, полностью отключив уведомления о вставке. Но это все равно, что кувалдой разбивать орех, так как может быть много других законных вариантов обработки событий вставки на сайтах.<br>Есть также некоторые плагины для браузера: они позволяют сканировать весь DOM и удалять код блокировщика или ввод паролей непосредственно на страницу. Но это не без риска: раскрытие паролей и полная история просмотра сторонним приложениям (которые, кстати, имеют полный доступ к сети). Кроме того, пользователи ограничены в выборе своего браузера, так как эти плагины часто не переносимы.<br>Это немного неправильно, когда веб-сайт (или кто-либо еще) решает, что пользователи могут или не могут делать на своих компьютерах. Однако есть надежда: вместо того, чтобы бороться с блокировщиками вставки, почему бы просто не ввести пароль «естественным» способом, который они ожидают - набрать его. Но ввод будет производиться операционной системой пользователя, а не самим пользователем: ОС может автоматически ввести очень сложный пароль из любого менеджера паролей за вас. И блокировщики вставки никогда не смогут это заблокировать, потому что это единственный способ по их замыслу, которым они должны позволять вводить пароль.<br>Эти «Войны вставки» закончились: представляю вам простой инструмент, который может вводить сложные пароли и восстанавливать права пользователей на вставку!",
	  "speakers": [
		"IgnatKorchagin"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "17:00",
	  "timeEnd": "17:50",
	  "lang": "Ru",
	  "location": "Room #1, 2nd floor",
	  "title": "Код как литература",
	  "talkTypeBadge": "Backend",
	  "talkLevelBadge": "Intermediate",
	  "description": "Почему же так трудно читать некоторые программы? Казалось бы, всё работает быстро, хорошо отформатирован код и используются лучшие практики из мира программирования, но всё равно такую программу тяжело читать и воспринимать. Если у вас возникает желание прекратить читать код и сделать перерыв, вероятнее всего, проблема не в вашей прокрастинации, а в чьей-то некачественной работе.<br>Кажется очевидным, что код, который мы пишем, должен быть удобочитаем, и многие лучшие программистские практики стараются это учитывать, но обычно они сосредоточены на абсолютно разных вещах. Причём большинство программистов даже не думают о своем коде как о литературе.<br>Почему кто-то пишет код, как Фридрих Ницше, а кто-то, как Кеннет Грэйм? Почему один код сложный, словно налоговый кодекс, а другой такой же понятный и простой, как сочинение пятиклассника? Почему один код заставляет вас плакать, прежде чем вы найдете ошибку, а другой логичен, как карта метро (но это не точно).<br>Энцефалограммы, чтоб почувствовать себя учёным, прилагаются!",
	  "speakers": [
		"FedorSavkin"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "17:00",
	  "timeEnd": "17:50",
	  "lang": "Ru",
	  "location": "13th floor",
	  "title": "Automatic Machine Learning: современное состояние",
	  "talkTypeBadge": "Data Science",
	  "talkLevelBadge": "Intermediate",
	  "description": "Основное время, которое тратит аналитик данных, уходит на перебор моделей и настройку их гиперпараметров. Автоматическое машинное обучение пытается автоматизировать оба этих процесса. За последние несколько лет эта тема стала набирать хайп с той же скоростью, что и в свое время глубокое обучение. В этом докладе я расскажу об основных направлениях, которые сейчас относят к автоматическому ML, а также поспекулирую на тему того, заменит ли искусственный интеллект аналитиков данных в ближайшие несколько лет.",
	  "speakers": [
		"AndreyFilchenkov"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "18:00",
	  "timeEnd": "18:50",
	  "lang": "En",
	  "location": "13th floor",
	  "title": "Почему нам следует бояться алгоритма Шора уже сейчас",
	  "talkTypeBadge": "Hype",
	  "talkLevelBadge": "Intermediate",
	  "description": "Квантовые компьютеры реальны и находят своё применение в области финансов, органической химии и сложных динамических систем. Однако, есть среди этих задач такие как алгоритм Шора.<br>При наличии достаточно мощного квантового компьютера алгоритм Шора способен разложить числа на множители за полиномиальное время. Я реализовал его на квантовом симуляторе, и он использовался на реальных квантовых компьютерах. Со временем, когда квантовые компьютеры будут достаточно мощными, почти все методы шифрования, на которые мы сейчас полагаемся, будут бесполезны.<br>Ещё далеко до того времени, когда RSA будет бесполезным, но я поделюсь некоторыми убедительными причинами, по которым нужно действовать уже сейчас, чтобы избежать катастрофы в ближайшем будущем.",
	  "speakers": [
		"JamesBirnie"
	  ]
	},
	{
	  "date": "2019-12-01",
	  "timeStart": "19:00",
	  "timeEnd": "19:20",
	  "lang": "",
	  "location": "13th floor",
	  "title": "Закрытие",
	  "talkTypeBadge": "",
	  "talkLevelBadge": "",
	  "description": "Закрытие",
	  "speakers": [
		"TBA"
	  ]
	}
]
